import redis
# 连接redis
print("Connect to redis...")
r_pool = redis.ConnectionPool(host="192.168.70.40", port=6379)
r_conn = redis.Redis(connection_pool=r_pool)


first_name_list = ['李', '王', '张', '刘', '陈', '杨', '黄', '赵', '周', '吴', '徐', '孙', '朱', '马', '胡', '郭', '林', '何', '高', '梁',
                   '郑', '罗', '宋', '谢', '唐', '韩', '曹', '许', '邓', '萧', '冯', '曾', '程', '蔡', '彭', '潘', '袁', '于', '董', '余',
                   '苏', '叶', '吕', '魏', '蒋', '田', '杜', '丁', '沈', '姜', '范', '江', '傅', '钟', '卢', '汪', '戴', '崔', '任', '陆',
                   '廖', '姚', '方', '金', '邱', '夏', '谭', '韦', '贾', '邹', '石', '熊', '孟', '秦', '阎', '薛', '侯', '雷', '白', '龙',
                   '段', '郝', '孔', '邵', '史', '毛', '常', '万', '顾', '赖', '武', '康', '贺', '严', '尹', '钱', '施', '牛', '洪', '龚',
                   '汤', '陶', '黎', '温', '莫', '易', '樊', '乔', '文', '安', '殷', '颜', '庄', '章', '鲁', '倪', '庞', '邢', '俞', '翟',
                   '蓝', '聂', '齐', '向', '申', '葛', '岳']

last_name_list = ['冰', '星', '志', '默', '彬', '鹏', '卫', '姣', '洁', '显', '悟', '朱', '雪', '娟', '壮', '泰', '娜', '蔼', '诚', '振',
                  '锐', '妯', '心', '轩', '法', '衡', '安', '芳', '敏', '文', '长', '西', '红', '和', '兵', '水', '挺', '东', '全', '夏',
                  '哲', '陈', '琴', '燕', '盈', '青', '妩', '山', '洪', '路', '义', '杰', '瑶', '江', '森', '仁', '维', '通', '直', '霞',
                  '金', '婵', '颖', '坦', '威', '一', '靖', '美', '昭', '泽', '喜', '余', '远', '侠', '学', '瑱', '英', '雅', '斌', '秀',
                  '鑫', '菲', '康', '倩', '柏', '家', '雄', '敦', '蓉', '光', '析', '然', '涛', '天', '立', '慧', '武', '容', '健', '丽',
                  '书', '灵', '良', '欣', '艳', '伟', '婷', '勤', '亮', '铁', '萍', '婉', '会', '恩', '华', '宇', '达', '宁', '富', '正',
                  '嘉', '宝', '墨', '银', '树', '石', '勇', '迪', '荣', '静', '悉', '梓', '梦', '我', '乎', '妃', '盛', '丰', '兰', '奕',
                  '蛾', '方', '萌', '巍', '龙', '的', '定', '君', '玉', '聪', '丝', '笑', '伦', '顺', '邪', '海', '兴', '道', '花', '睿',
                  '明', '丹', '贤', '俊', '思', '飞', '姿', '永', '河', '清', '帅', '旺', '坤', '德', '松', '耀', '媚', '晓', '潇', '云',
                  '磊', '小', '昌', '昆', '平', '发', '梅', '超', '玲', '刚', '晰', '同', '琳', '浩', '焕', '魅', '近']

key = "BD:KeyWord"

for name in first_name_list:
    r_conn.sadd(key, name)

for name in last_name_list:
    r_conn.sadd(key, name)